rails/sample-app/app/models/user.rb

  def follow(other_user)
    active_relationships.create(followed_id: other_user.id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 3], ["created_at", "2018-07-27 09:38:59.146261"], ["updated_at", "2018-07-27 09:38:59.146261"]]